Product.seed do |s|
  s.id = 1
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL1'
  s.remarks = 'OLYMPUS PEN E-PL1は
コンパクトで携帯性に優れた
ミラーレス一眼レフカメラです！
1230万画素の高画質とハイビジョンムービー機能
オリジナリティあふれる表現を可能にする
ライブガイドなど多彩な機能を兼ね備え
これからカメラを始める方には最適です♪

産まれたばかりの赤ちゃん、動き回るお子様、運動会、景色、
車なんんでも簡単綺麗に撮影できます❤︎'
end

Product.seed do |s|
  s.id = 2
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL1s'
  s.remarks = 'いつでも気軽に持ち歩けるフラッシュ内蔵の世界最軽量（当時）のE-PL1sは、
高速＆静音AFだから静止画も動画も楽しめます。

背景をぼかす事はもちろん、動きを止めたり、鮮やかさを変更したりといった
一眼カメラならではのオリジナリティあふれる表現がどなたでも簡単に行える「ライブガイド」を搭載しています。︎'
end

Product.seed do |s|
  s.id = 3
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL2'
  s.remarks = '6種類のアートフィルターを搭載♪
ボディ内手振れ補正機構や
瞳検出ＡＦ、動く被写体に
ピントを合わせ続ける
追尾ＡＦなど機能も充実！！
1,230万画素と初心者の方にも
大満足なミラーレス一眼です♪︎'
end

Product.seed do |s|
  s.id = 4
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL3'
  s.remarks = 'ボディデザインは女性が持つことを意識されていて、
いかにもデジタル一眼的な印象ではなく、スッキリとして
お洒落な雰囲気が漂っています♪

トイフォトやジオラマなど６種類のアートフィルターを
搭載していて写真の表現力を非常に豊かにしてくれます♪

軽くて持ち運びやすく一眼レフデビューにおすすめの機種です!!!'
end

Product.seed do |s|
  s.id = 5
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL5'
  s.remarks = 'ボディデザインは女性が持つことも意識されていて、
いかにもデジタル一眼的な印象ではなく、
スッキリとしてオシャレな雰囲気が漂っています♪

可動式モニター搭載で
様々なシチュエーションでも
快適に撮影できます♪
自撮りにも最適です！

トイフォトやジオラマなど
様々アートフィルターを搭載していて
写真の表現力を非常に豊かにしてくれます♪
軽くて持ち運びやすく
ミラーレス一眼デビューにオススメの機種です♪'
end

Product.seed do |s|
  s.id = 6
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL6'
  s.remarks = 'ボディデザインは女性が持つことを意識されていて、スッキリとしてお洒落な雰囲気が漂っています♪

グリップはオマケ程度の飾りではなく、しっかりとしていて手ブレが防止されます！

トイフォトやジオラマなど６種類のアートフィルターを搭載していて写真の表現力を非常に豊かにしてくれます♪

軽くて持ち運びやすく一眼レフデビューにおすすめの機種です♪'
end

Product.seed do |s|
  s.id = 7
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL7'
  s.remarks = 'コンパクトで携帯性に優れた
ミラーレス一眼カメラです！

下開きの自撮り液晶モニターや
モニターを回転させると自動的に
起動する自分撮りモードが快適で
お友達との楽しい撮影体験を提供します♪

シリーズ初のWiFi機能搭載！！
撮影した一眼ならではの綺麗な写真は
スマートフォンにその場でスグ転送♪

友人や家族とシェアしたりSNSにアップしたり
様々にお楽しみ頂けます♪'
end

Product.seed do |s|
  s.id = 8
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL8'
end

Product.seed do |s|
  s.id = 9
  s.type = 'Body'
  s.maker = 1
  s.name = 'E-PL9'
end

Product.seed do |s|
  s.id = 10
  s.type = 'Lense'
  s.maker = 1
  s.name = 'M.ZUIKO 14-42mm'
  s.remarks = '普段使いに最適な小型軽量ズームとなっており、
風景や景色など静止画の撮影から、
運動会などの動きのある場面での撮影まで幅広く対応しております♪

また、動画撮影に対応した機種では動画もスムーズに撮ることができます♪
高速＆清音のオートフォーカスが特徴で、
スッとピントが合います！'
end

Product.seed do |s|
  s.id = 11
  s.type = 'Lense'
  s.maker = 1
  s.name = 'M.ZUIKO 40-150mm'
  s.remarks = 'オリンパス E-P、E-PLシリーズ用の大人気ズームレンズです♪
軽くて持ち運びやすく
コンパクトなレンズが欲しいという方にピッタリです！

軽量でコンパクトながら
35mm換算すると、28-84mmの３倍ズーム対応ですので
普段使いや旅行などで大活躍間違いなしです♪

大変人気が高く迷っている間に売れてしまう商品です。
この機会をお見逃しなく！'
end

Product.seed do |s|
  s.id = 12
  s.type = 'Lense'
  s.maker = 1
  s.name = 'M.ZUIKO 14-42mm II'
  s.remarks = '普段使いに最適な小型軽量ズームとなっており、
風景や景色など静止画の撮影から、
運動会などの動きのある場面での撮影まで幅広く対応しております♪

また、動画撮影に対応した機種では動画もスムーズに撮ることができます♪
高速＆清音のオートフォーカスが特徴で、
スッとピントが合います！'
end

Product.seed do |s|
  s.id = 13
  s.type = 'Lense'
  s.maker = 1
  s.name = 'M.ZUIKO 40-150mm II'
  s.remarks = 'オリンパス E-P、E-PLシリーズ用の大人気ズームレンズです♪
軽くて持ち運びやすく
コンパクトなレンズが欲しいという方にピッタリです！

軽量でコンパクトながら
35mm換算すると、28-84mmの３倍ズーム対応ですので
普段使いや旅行などで大活躍間違いなしです♪

大変人気が高く迷っている間に売れてしまう商品です。
この機会をお見逃しなく！'
end

Product.seed do |s|
  s.id = 14
  s.type = 'Lense'
  s.maker = 1
  s.name = 'M.ZUIKO 17mm'
  s.remarks = 'OLYMPUS PENシリーズや
Panasonic LUMIXミラーレス一眼カメラに
装着可能な可愛いパンケーキレンズ！！

とても薄型でコンパクト(^_-)-☆
持ち運びも便利でミラーレス女子に
とても人気の商品です♪

様々な洋服にしっくり馴染む
シルバーを使用♪
人気の秘密はここにあります!(^^)!
持っているだけで可愛くて
オシャレな気分を味わえます☆彡

旅先のお供に一本持っておくと重宝します！！'
end

Product.seed do |s|
  s.id = 15
  s.type = 'Lense'
  s.maker = 1
  s.name = 'BCL-1580 15mm'
  s.remarks = '薄さ9mm、カメラマウント用のボディーキャップと見紛うほどの超薄型のレンズです。
3群3枚のオールガラスのレンズ構成で、焦点距離30mm相当（35mm判換算）の単焦点広角レンズとして使用できます。
広角で被写界深度も深いため、パンフォーカスレンズとして普段使いできる他、マニュアルフォーカスも可能です。

近接撮影距離は30cmです。レンズ保護バリア付きなのでカメラに付けて、そのままポケットへ。
普段はボディーキャップとして、撮影時には、スナップ用パンフォーカスレンズとして、すばやく気軽に写真を楽しめます。
ボディー内手ぶれ補正機構搭載のOM-DやPENと一緒に使えば、手ぶれ補正も有効です。'
end

Product.seed do |s|
  s.id = 16
  s.type = 'Lense'
  s.maker = 2
  s.name = 'NIKKOR 18-55mm VR'
  s.remarks = '【手ブレ補正機構（VR）搭載標準ズームレンズ】 ニコン独自のVR機構により、シャッタースピード約3段分の手ブレを軽減します。 
【ズーム全域で最短撮影距離0.28mを実現】 非球面レンズでさまざまな収差を効果的に補正し、最短28cmまで被写体に近づいて撮影できます（最大撮影倍率1/3.2倍・55mm時）。 
焦点距離：18-55mm
最大絞り：F3.5－5.6
最小絞り：F22－36
レンズ構成：8群11枚構成（非球面レンズ1枚を含む）
画角：76度－28度50分
最短撮影距離：0.28m
絞り羽根枚数：7枚（円形絞り）
アタッチメントサイズ：52mm
大きさ：約73mm（最大径）×79.5mm（バヨネットマウントから基準面からレンズ先端まで）
質量（約）：265g'
end